In [ ]:
Assignment

In [3]:
cursor.execute("SHOW TABLES")
tables = cursor.fetchall()
for t in tables:
    print(t)

('employees',)

In [4]:
cursor.execute("SELECT * FROM employees")
rows = cursor.fetchall()
for row in rows:
    print(row)

(101, 'Rahul Mehta', 'Sales', 'Delhi', 55000, '2020-04-12')
(102, 'Priya Sharma', 'HR', 'Mumbai', 62000, '2019-09-25')
(103, 'Aman Singh', 'IT', 'Bengaluru', 72000, '2021-03-10')
(104, 'Neha Patel', 'Sales', 'Delhi', 48000, '2022-01-14')
(105, 'Karan Joshi', 'Marketing', 'Pune', 45000, '2018-07-22')
(106, 'Divya Nair', 'IT', 'Chennai', 81000, '2019-12-11')
(107, 'Raj Kumar', 'HR', 'Delhi', 60000, '2020-05-28')
(108, 'Simran kaur', 'Finance', 'Mumbai', 58000, '2021-08-03')
(109, 'Arjun Reddy', 'IT', 'Hyderabad', 70000, '2022-02-18')
(110, 'Anjali Das', 'Sales', 'Kolkata', 51000, '2023-01-15')

In [5]:
import pandas as pd
df = pd.read_sql("SELECT * FROM employees",conn)
df

C:\Users\Sneha\AppData\Local\Temp\ipykernel_14724\1948842817.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT * FROM employees",conn)

   EmpID       EmpName Department       City  Salary    HireDate
0    101   Rahul Mehta      Sales      Delhi   55000  2020-04-12
1    102  Priya Sharma         HR     Mumbai   62000  2019-09-25
2    103    Aman Singh         IT  Bengaluru   72000  2021-03-10
3    104    Neha Patel      Sales      Delhi   48000  2022-01-14
4    105   Karan Joshi  Marketing       Pune   45000  2018-07-22
5    106    Divya Nair         IT    Chennai   81000  2019-12-11
6    107     Raj Kumar         HR      Delhi   60000  2020-05-28
7    108   Simran kaur    Finance     Mumbai   58000  2021-08-03
8    109   Arjun Reddy         IT  Hyderabad   70000  2022-02-18
9    110    Anjali Das      Sales    Kolkata   51000  2023-01-15

In [8]:
#Question 1 -  Show employees working in either the ‘IT’ or ‘HR’ departments.
import pandas as pd
df = pd.read_sql( "SELECT * FROM employees WHERE Department = 'IT' or department = 'HR'",conn)
df

C:\Users\Sneha\AppData\Local\Temp\ipykernel_21540\1460337851.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql( "SELECT * FROM employees WHERE Department = 'IT' or department = 'HR'",conn)

   EmpID       EmpName Department       City  Salary    HireDate
0    102  Priya Sharma         HR     Mumbai   62000  2019-09-25
1    103    Aman Singh         IT  Bengaluru   72000  2021-03-10
2    106    Divya Nair         IT    Chennai   81000  2019-12-11
3    107     Raj Kumar         HR      Delhi   60000  2020-05-28
4    109   Arjun Reddy         IT  Hyderabad   70000  2022-02-18

In [6]:
#Question 2 - Retrieve employees whose department is in ‘Sales’, ‘IT’, or ‘Finance’.
df = pd.read_sql("SELECT * FROM employees WHERE department = 'Sales' or department = 'IT' or department = 'Finance'",conn)
df

C:\Users\Sneha\AppData\Local\Temp\ipykernel_14724\1001986155.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT * FROM employees WHERE department = 'Sales' or department = 'IT' or department = 'Finance'",conn)

   EmpID      EmpName Department       City  Salary    HireDate
0    101  Rahul Mehta      Sales      Delhi   55000  2020-04-12
1    103   Aman Singh         IT  Bengaluru   72000  2021-03-10
2    104   Neha Patel      Sales      Delhi   48000  2022-01-14
3    106   Divya Nair         IT    Chennai   81000  2019-12-11
4    108  Simran kaur    Finance     Mumbai   58000  2021-08-03
5    109  Arjun Reddy         IT  Hyderabad   70000  2022-02-18
6    110   Anjali Das      Sales    Kolkata   51000  2023-01-15

In [7]:
#Question 3 - Display employees whose salary is between ₹50,000 and ₹70,000.
df = pd.read_sql("SELECT * FROM employees WHERE salary between 50000 and 70000",conn)
df

C:\Users\Sneha\AppData\Local\Temp\ipykernel_14724\3311259860.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT * FROM employees WHERE salary between 50000 and 70000",conn)

   EmpID       EmpName Department       City  Salary    HireDate
0    101   Rahul Mehta      Sales      Delhi   55000  2020-04-12
1    102  Priya Sharma         HR     Mumbai   62000  2019-09-25
2    107     Raj Kumar         HR      Delhi   60000  2020-05-28
3    108   Simran kaur    Finance     Mumbai   58000  2021-08-03
4    109   Arjun Reddy         IT  Hyderabad   70000  2022-02-18
5    110    Anjali Das      Sales    Kolkata   51000  2023-01-15

In [8]:
#Question 4 -  List employees whose names start with the letter ‘A’.
df = pd.read_sql("SELECT * FROM employees WHERE EmpName like 'A%'",conn)
df

C:\Users\Sneha\AppData\Local\Temp\ipykernel_14724\3034380578.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT * FROM employees WHERE EmpName like 'A%'",conn)

   EmpID      EmpName Department       City  Salary    HireDate
0    103   Aman Singh         IT  Bengaluru   72000  2021-03-10
1    109  Arjun Reddy         IT  Hyderabad   70000  2022-02-18
2    110   Anjali Das      Sales    Kolkata   51000  2023-01-15

In [9]:
#Question 5 -  Find employees whose names contain the substring ‘an’.
df = pd.read_sql("SELECT * FROM employees WHERE EmpName like '%an%'",conn)
df

C:\Users\Sneha\AppData\Local\Temp\ipykernel_14724\660299352.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT * FROM employees WHERE EmpName like '%an%'",conn)

   EmpID      EmpName Department       City  Salary    HireDate
0    103   Aman Singh         IT  Bengaluru   72000  2021-03-10
1    105  Karan Joshi  Marketing       Pune   45000  2018-07-22
2    108  Simran kaur    Finance     Mumbai   58000  2021-08-03
3    110   Anjali Das      Sales    Kolkata   51000  2023-01-15

In [10]:
#Question 6 -  Show employees who are from ‘Delhi’ or ‘Mumbai’ and earn more than ₹55,000.
df = pd.read_sql("SELECT * FROM employees WHERE City = 'Delhi' or City = 'Mumbai' and salary > 55000",conn)
df

C:\Users\Sneha\AppData\Local\Temp\ipykernel_14724\3616473326.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT * FROM employees WHERE City = 'Delhi' or City = 'Mumbai' and salary > 55000",conn)

   EmpID       EmpName Department    City  Salary    HireDate
0    101   Rahul Mehta      Sales   Delhi   55000  2020-04-12
1    102  Priya Sharma         HR  Mumbai   62000  2019-09-25
2    104    Neha Patel      Sales   Delhi   48000  2022-01-14
3    107     Raj Kumar         HR   Delhi   60000  2020-05-28
4    108   Simran kaur    Finance  Mumbai   58000  2021-08-03

In [11]:
#Question 7 - Display all employees except those from the ‘HR’ department.
df = pd.read_sql("SELECT * FROM employees WHERE department <> 'HR'",conn)
df

C:\Users\Sneha\AppData\Local\Temp\ipykernel_14724\2426625183.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT * FROM employees WHERE department <> 'HR'",conn)

   EmpID      EmpName Department       City  Salary    HireDate
0    101  Rahul Mehta      Sales      Delhi   55000  2020-04-12
1    103   Aman Singh         IT  Bengaluru   72000  2021-03-10
2    104   Neha Patel      Sales      Delhi   48000  2022-01-14
3    105  Karan Joshi  Marketing       Pune   45000  2018-07-22
4    106   Divya Nair         IT    Chennai   81000  2019-12-11
5    108  Simran kaur    Finance     Mumbai   58000  2021-08-03
6    109  Arjun Reddy         IT  Hyderabad   70000  2022-02-18
7    110   Anjali Das      Sales    Kolkata   51000  2023-01-15

In [12]:
#Question 8 -  Get all employees hired between 2019 and 2022, ordered by HireDate (oldest first).
df = pd.read_sql("SELECT * FROM employees WHERE HireDate between 2019 and 2022 ORDER BY HireDate asc",conn)
df

C:\Users\Sneha\AppData\Local\Temp\ipykernel_14724\1193706320.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT * FROM employees WHERE HireDate between 2019 and 2022 ORDER BY HireDate asc",conn)

   EmpID       EmpName Department       City  Salary    HireDate
0    102  Priya Sharma         HR     Mumbai   62000  2019-09-25
1    106    Divya Nair         IT    Chennai   81000  2019-12-11
2    101   Rahul Mehta      Sales      Delhi   55000  2020-04-12
3    107     Raj Kumar         HR      Delhi   60000  2020-05-28
4    103    Aman Singh         IT  Bengaluru   72000  2021-03-10
5    108   Simran kaur    Finance     Mumbai   58000  2021-08-03
6    104    Neha Patel      Sales      Delhi   48000  2022-01-14
7    109   Arjun Reddy         IT  Hyderabad   70000  2022-02-18